#+title: An Org to Beamer SIGPwny Presentation Demo
#+author: Some Authors
#+date:
#+options: toc:nil
#+latex_class_options: [10pt]
#+latex_header: \usetheme{sigpwny}
#+latex_header: \setminted{linenos=true, breaklines=true, breakanywhere=true, style=default}
#+latex_header: \usemintedstyle{monokai}


* Org Mode Makes Everything Nicer

  Simple markdown like syntax:
  - *Bold*
  - /Italic/
  - _Underline_


  Cool table stuff:
  #+ATTR_LATEX: :booktabs t
  | Scheme | Hard Problem        |
  |--------+---------------------|
  | RSA    | Prime factorization |
  | DH/ECC | Discrete logarithm  |

* Source Code is Easier Too

 #+BEGIN_SRC python :results output :exports both
   print("Hello world!")
 #+END_SRC

 #+RESULTS:
 : Hello world!

* And Still Exports to Beamer

  No more writing raw TeX.
